# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''


#_______________________________________________________________________________

#Answer

mask32	='255.255.255.255'
mask31  ='255.255.255.254'
mask30	='255.255.255.252'
mask29	='255.255.255.248'
mask28	='255.255.255.240'
mask27	='255.255.255.224'
mask26	='255.255.255.192'
mask25	='255.255.255.128'
mask24	='255.255.255.000'

ip = input('Введите IP сеть (формат: х.х.х.х/x): ')
ip_add, mask = ip.split('/')
ip0, ip1, ip2,ip3 = ip_add.split('.') # таким образом сразу назначаются 4 переменных чтоб разбить айпи по октетам.



generate_mask = "mask{}".format(mask)
mask0, mask1, mask2, mask3 = eval(generate_mask).split('.') # eval преобразовывает строку в переменную.

template = """
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}

Mask:
/{mask} 
{mask0:<10}{mask1:<10}{mask2:<10}{mask3:<10}
{mask0:08b}  {mask1:08b}  {mask2:08b}  {mask3:08b}


""".format(int(ip0), int(ip1), int(ip2), int(ip3), mask0 = int(mask0), mask = mask, mask1 = int(mask1), mask2 = int(mask2), mask3 = int(mask3))

print(template)
